RT-Thread/rt-thread/bsp/lm3s9b9x/Libraries/driverlib/pin_map.h
#define C1O_PERIPH              SYSCTL_PERIPH_GPIOC
#define C1O_PORT                GPIO_PORTC_BASE
#define C1O_PIN                 GPIO_PIN_7

#define C1_MINUS_PERIPH         SYSCTL_PERIPH_GPIOB
#define C1_MINUS_PORT           GPIO_PORTB_BASE
#define C1_MINUS_PIN            GPIO_PIN_5

#define C1_PLUS_PERIPH          SYSCTL_PERIPH_GPIOC
#define C1_PLUS_PORT            GPIO_PORTC_BASE
#define C1_PLUS_PIN             GPIO_PIN_7

#define CAN0RX_PERIPH           SYSCTL_PERIPH_GPIOA
#define CAN0RX_PORT             GPIO_PORTA_BASE
#define CAN0RX_PIN              GPIO_PIN_4

#define CAN0TX_PERIPH           SYSCTL_PERIPH_GPIOA
#define CAN0TX_PORT             GPIO_PORTA_BASE
#define CAN0TX_PIN              GPIO_PIN_5

#define FAULT0_PERIPH           SYSCTL_PERIPH_GPIOE
#define FAULT0_PORT             GPIO_PORTE_BASE
#define FAULT0_PIN              GPIO_PIN_4

#define I2C0SCL_PERIPH          SYSCTL_PERIPH_GPIOB
#define I2C0SCL_PORT            GPIO_PORTB_BASE
#define I2C0SCL_PIN             GPIO_PIN_2

#define I2C0SDA_PERIPH          SYSCTL_PERIPH_GPIOB
#define I2C0SDA_PORT            GPIO_PORTB_BASE
#define I2C0SDA_PIN             GPIO_PIN_3

#define IDX0_PERIPH             SYSCTL_PERIPH_GPIOD
#define IDX0_PORT               GPIO_PORTD_BASE
#define IDX0_PIN                GPIO_PIN_0

#define NMI_PERIPH              SYSCTL_PERIPH_GPIOB
#define NMI_PORT                GPIO_PORTB_BASE
#define NMI_PIN                 GPIO_PIN_7

#define PHA0_PERIPH             SYSCTL_PERIPH_GPIOC
#define PHA0_PORT               GPIO_PORTC_BASE
#define PHA0_PIN                GPIO_PIN_4

#define PHB0_PERIPH             SYSCTL_PERIPH_GPIOC
#define PHB0_PORT               GPIO_PORTC_BASE
#define PHB0_PIN                GPIO_PIN_6

#define PWM0_PERIPH             SYSCTL_PERIPH_GPIOA
#define PWM0_PORT               GPIO_PORTA_BASE
#define PWM0_PIN                GPIO_PIN_6

#define PWM1_PERIPH             SYSCTL_PERIPH_GPIOA
#define PWM1_PORT               GPIO_PORTA_BASE
#define PWM1_PIN                GPIO_PIN_7

#define PWM2_PERIPH             SYSCTL_PERIPH_GPIOB
#define PWM2_PORT               GPIO_PORTB_BASE
#define PWM2_PIN                GPIO_PIN_0

#define PWM3_PERIPH             SYSCTL_PERIPH_GPIOB
#define PWM3_PORT               GPIO_PORTB_BASE
#define PWM3_PIN                GPIO_PIN_1

#define PWM4_PERIPH             SYSCTL_PERIPH_GPIOA
#define PWM4_PORT               GPIO_PORTA_BASE
#define PWM4_PIN                GPIO_PIN_2

#define PWM5_PERIPH             SYSCTL_PERIPH_GPIOA
#define PWM5_PORT               GPIO_PORTA_BASE
#define PWM5_PIN                GPIO_PIN_3

#define SWCLK_PERIPH            SYSCTL_PERIPH_GPIOC
#define SWCLK_PORT              GPIO_PORTC_BASE
#define SWCLK_PIN               GPIO_PIN_0

#define SWDIO_PERIPH            SYSCTL_PERIPH_GPIOC
#define SWDIO_PORT              GPIO_PORTC_BASE
#define SWDIO_PIN               GPIO_PIN_1

#define SWO_PERIPH              SYSCTL_PERIPH_GPIOC
#define SWO_PORT                GPIO_PORTC_BASE
#define SWO_PIN                 GPIO_PIN_3

#define TCK_PERIPH              SYSCTL_PERIPH_GPIOC
#define TCK_PORT                GPIO_PORTC_BASE
#define TCK_PIN                 GPIO_PIN_0

#define TDI_PERIPH              SYSCTL_PERIPH_GPIOC
#define TDI_PORT                GPIO_PORTC_BASE
#define TDI_PIN                 GPIO_PIN_2

#define TDO_PERIPH              SYSCTL_PERIPH_GPIOC
#define TDO_PORT                GPIO_PORTC_BASE
#define TDO_PIN                 GPIO_PIN_3

#define TMS_PERIPH              SYSCTL_PERIPH_GPIOC
#define TMS_PORT                GPIO_PORTC_BASE
#define TMS_PIN                 GPIO_PIN_1

#define U0RX_PERIPH             SYSCTL_PERIPH_GPIOA
#define U0RX_PORT               GPIO_PORTA_BASE
#define U0RX_PIN                GPIO_PIN_0

#define U0TX_PERIPH             SYSCTL_PERIPH_GPIOA
#define U0TX_PORT               GPIO_PORTA_BASE
#define U0TX_PIN                GPIO_PIN_1

#endif // PART_LM3S2616

//*****************************************************************************
//
// LM3S2620 Port/Pin Mapping Definitions
//
//*****************************************************************************
#ifdef PART_LM3S2620

#define C0O_PERIPH              SYSCTL_PERIPH_GPIOF
#define C0O_PORT                GPIO_PORTF_BASE
#define C0O_PIN                 GPIO_PIN_4

#define C0_MINUS_PERIPH         SYSCTL_PERIPH_GPIOB
#define C0_MINUS_PORT           GPIO_PORTB_BASE
#define C0_MINUS_PIN            GPIO_PIN_4

#define C0_PLUS_PERIPH          SYSCTL_PERIPH_GPIOB
#define C0_PLUS_PORT            GPIO_PORTB_BASE
#define C0_PLUS_PIN             GPIO_PIN_6

#define C1O_PERIPH              SYSCTL_PERIPH_GPIOE
#define C1O_PORT                GPIO_PORTE_BASE
#define C1O_PIN                 GPIO_PIN_6

#define C1_MINUS_PERIPH         SYSCTL_PERIPH_GPIOB
#define C1_MINUS_PORT           GPIO_PORTB_BASE
#define C1_MINUS_PIN            GPIO_PIN_5

#define C1_PLUS_PERIPH          SYSCTL_PERIPH_GPIOC
#define C1_PLUS_PORT            GPIO_PORTC_BASE
#define C1_PLUS_PIN             GPIO_PIN_5

#define C2O_PERIPH              SYSCTL_PERIPH_GPIOE
#define C2O_PORT                GPIO_PORTE_BASE
#define C2O_PIN                 GPIO_PIN_7

#define C2_MINUS_PERIPH         SYSCTL_PERIPH_GPIOC
#define C2_MINUS_PORT           GPIO_PORTC_BASE
#define C2_MINUS_PIN            GPIO_PIN_7

#define C2_PLUS_PERIPH          SYSCTL_PERIPH_GPIOC
#define C2_PLUS_PORT            GPIO_PORTC_BASE
#define C2_PLUS_PIN             GPIO_PIN_6

#define CAN0RX_PERIPH           SYSCTL_PERIPH_GPIOD
#define CAN0RX_PORT             GPIO_PORTD_BASE
#define CAN0RX_PIN              GPIO_PIN_0

#define CAN0TX_PERIPH           SYSCTL_PERIPH_GPIOD
#define CAN0TX_PORT             GPIO_PORTD_BASE
#define CAN0TX_PIN              GPIO_PIN_1

#define CAN1RX_PERIPH           SYSCTL_PERIPH_GPIOF
#define CAN1RX_PORT             GPIO_PORTF_BASE
#define CAN1RX_PIN              GPIO_PIN_0

#define CAN1TX_PERIPH           SYSCTL_PERIPH_GPIOF
#define CAN1TX_PORT             GPIO_PORTF_BASE
#define CAN1TX_PIN              GPIO_PIN_1

#define CCP0_PERIPH             SYSCTL_PERIPH_GPIOB
#define CCP0_PORT               GPIO_PORTB_BASE
#define CCP0_PIN                GPIO_PIN_0

#define CCP1_PERIPH             SYSCTL_PERIPH_GPIOA
#define CCP1_PORT               GPIO_PORTA_BASE
#define CCP1_PIN                GPIO_PIN_6

